app/controllers/students_controller.rb

  def show
    @student = Student.find(:id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]